Revit 2027 API
Rebar.TotalLength Property
 The length of an individual bar multiplied by Quantity.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalLength { get; }
Public ReadOnly Property TotalLength As Double
	Get
public:
property double TotalLength {
	double get ();
}
member TotalLength : float with get
Property Value
Double
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace